##
# preflight
##

# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'homebrew/core'
# tap 'homebrew/boneyard'
# tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

# cli for installing apps of the Mac App Store
brew 'mas'

##
# Browsers
##

cask 'google-chrome'

# WebDriver which is oss tools for automated testing of webapps across web browsers
# for selenium
cask 'chromedriver'

##
# Chat
##

cask 'microsoft-teams'
cask 'slack'

mas 'LINE', id: 539883307

##
# Terminals
##

cask 'iterm2'

# Tmux is a newer terminal multiplexer.
brew 'tmux'

##
# Shells
##

brew 'zsh'
brew 'fish'

##
# terminal tools
##

# interactive filtering tool
brew 'peco'

# ag is "the silver searcher" search tool; retired by ripgrep.
brew 'ag'

# jq is a lightweight and flexible command-line JSON processor.
brew 'jq'

# yq is a lightweight and flexible command-line YAML processor.
brew 'yq'

# Tree is a directory lister that shows a tree outline
brew 'tree'

##
# Editor
##

brew 'vim'
# cask 'macvim'
brew 'neovim'
brew 'less'

##
# IDE
##

cask 'visual-studio-code'

mas 'Xcode', id: 497799835

##
# Downloaders
##

brew 'curl', link: true


##
# language
##

# node.js
brew 'node'

# package manager for node.js
brew 'yarn'

# golang
brew 'go'

# ruby
brew 'rbenv'

##
# Version control
##

brew 'git'
cask 'sourcetree'

brew 'ghq'
brew 'hub'

##
# cloud
##

brew 'serverless'

##
# container
##

# docker for mac
cask 'docker'

# the cli tool for kubernetes
#   - commented out because it is installed with docker
# brew 'kubectl'

# the package manager for kubernetes
brew 'helm'

##
# font
##

cask 'font-cica'


##
# ime
##

cask 'google-japanese-ime'


##
# Multimedia
##

cask 'vlc'
cask 'skitch'

# ebook viewer
cask 'kindle'

# BlackHole is a modern macOS virtual audio driver that allows applications to pass audio to other applications with zero additional latency.
cask 'blackhole-16ch'

##
# launcher
##

cask 'alfred'


##
# Meeting
##

cask 'zoom'

##
# Note, memo
##

cask 'notion'


##
# Storage service
##

cask 'dropbox'


##
# Passwords manager
##

# password manager
cask 'bitwarden'

# password generator
brew 'pwgen'

##
# Office
##

# mas 'microsoft-365', id: 1450038993

##
# Anti-virus
##

# cask 'avast-security'


##
# Misc
##

cask 'flux'

# clipboard manager

# clipy doesn't work copying screenshot, so switch to maccy
# cask 'clipy'

cask 'maccy'

# list the shortcut keys for each applications
cask 'cheatsheet'
