##
# preflight
##

# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'homebrew/core'
# tap 'homebrew/boneyard'
# tap 'homebrew/dev-tools'
tap 'homebrew/bundle'
tap 'homebrew/services'

# alpha
# tap 'adoptopenjdk/openjdk'


# cli for installing apps of the Mac App Store
brew 'mas'

##
# Browsers
##

cask 'google-chrome'

# WebDriver which is oss tools for automated testing of webapps across web browsers
# for selenium
cask 'chromedriver'

##
# Chat
##

# cask 'microsoft-teams'
cask 'slack'

mas 'LINE', id: 539883307

##
# Terminals
##

cask 'iterm2'

# Tmux is a newer terminal multiplexer.
brew 'tmux'

##
# Shells
##

brew 'zsh'
brew 'fish'

##
# terminal tools
##

# interactive filtering tool
brew 'peco'

# ag is "the silver searcher" search tool; retired by ripgrep.
brew 'ag'

# jq is a lightweight and flexible command-line JSON processor.
brew 'jq'

# yq is a lightweight and flexible command-line YAML processor.
brew 'yq'

# Tree is a directory lister that shows a tree outline
brew 'tree'

##
# Editor
##

brew 'vim'
# cask 'macvim'
brew 'neovim'
brew 'neovim-qt'
brew 'less'

# to install vimr ---------
# brew 'carthage'
# brew 'coreutils'
# brew 'gnu-sed'
# brew 'libtool'
# brew 'automake'
# brew 'cmake'
# brew 'pkg-config'
# brew 'gettext'
# brew 'ninja'
# brew 'coreutils'

# brew 'python3'
# -------------------------


##
# IDE
##

cask 'visual-studio-code'

mas 'Xcode', id: 497799835

# cask 'intellij-idea-ce'

# Tools for building Android applications
cask 'android-studio'


# tools for building Android applications
cask 'android-studio'

##
# Downloaders
##

brew 'curl', link: true

brew 'wget'

##
# language
##

# node.js
brew 'node'

# package manager for node.js
brew 'yarn'

# golang
brew 'go'

# ruby
brew 'rbenv'

# java
# cask 'adoptopenjdk15'

# brew 'micronaut'

# UI toolkit for building applications for mobile, web and desktop
cask 'flutter'

# Dependency manager for Cocoa projects
brew 'cocoapods'


# build tools
# brew 'gradle'


# flutter
cask 'flutter'

##
# Version control
##

brew 'git'
cask 'sourcetree'

brew 'ghq'
brew 'hub'

brew 'git-crypt'

# Git Large File Storage
brew 'git-lfs'

# Prevents you from committing sensitive information to a git repo
brew 'git-secrets'

##
# network / vpn
##
brew 'sshuttle'

# Free and open-source OpenVPN client
cask 'tunnelblick'

# api client
cask 'postman'

##
# database
##
# cask 'dbeaver-community'


##
# cloud
##

brew 'awscli'
brew 'serverless'
# brew 'packer'

##
# IaC
##

brew 'terraform'
brew 'terragrunt'
brew 'ansible'

##
# container
##

# docker for mac
cask 'docker'

# the cli tool for kubernetes
#   - commented out because it is installed with docker
# brew 'kubectl'

# the package manager for kubernetes
brew 'helm'

# Faster way to switch between clusters and namespaces in kubectl
brew 'kubectx'

# Bulk port forwarding Kubernetes services for local development.
brew 'txn2/tap/kubefwd'

# ðŸ¶ Kubernetes CLI To Manage Your Clusters In Style
# brew 'derailed/k9s/k9s'

# âŽˆ Multi pod and container log tailing for Kubernetes
brew 'stern'


##
# font
##

cask 'font-cica'


##
# ime
##

cask 'google-japanese-ime'


##
# Multimedia
##

cask 'vlc'
cask 'skitch'

# ebook viewer
cask 'kindle'

# Epubor Ulitimate: Convert and remove DRM on eBooks
cask 'ultimate'


# music
cask 'spotify'

# BlackHole is a modern macOS virtual audio driver that allows applications to pass audio to other applications with zero additional latency.
cask 'blackhole-16ch'

##
# launcher
##

# cask 'alfred'
cask 'raycast'

# alfread plugin
# https://github.com/meyer/alfred-emoji-workflow

##
# Meeting
##

cask 'zoom'

##
# Note, memo
##

cask 'notion'
cask 'evernote'


##
# Storage service
##

cask 'dropbox'


##
# Passwords manager
##

# password manager
cask 'bitwarden'
brew 'bitwarden-cli'

# password generator
brew 'pwgen'

##
# Office
##

# mas 'microsoft-365', id: 1450038993

##
# Anti-virus
##

# cask 'avast-security'


##
# Misc
##

cask 'flux'

# clipboard manager

# clipy doesn't work copying screenshot, so switch to maccy
# cask 'clipy'

cask 'maccy'

# Snippets manager
mas 'Snippety', id: 1530751461

# Tool to manage the size and position of windows
# => Substituted by raycast
# cask 'shiftit'

# Yet another keyboard window switcher for your Mac
cask 'hyperswitch'

# list the shortcut keys for each applications
# cask 'cheatsheet'
# Snippets Manager
#   manually installed; Can not install from brew.
# mas 'Snippety', id: 1530751461
